ams/src/DataProcessors/AMS_Регламент/AMS_Регламент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_Регламент</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ams/src/InformationRegisters/_ПродажиПоМесяцам/_ПродажиПоМесяцам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ПродажиПоМесяцам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПродаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/_ВариантыСпецификацийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ВариантыСпецификацийНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаЗамес</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаУпаковку</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереработкаБрака</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ЧЗ_МаслоСмазочное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ЧЗ_БытоваяХимия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/AMS_Регламент/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ AMS_ВызовСервера.ЭтоKhors() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	
	// НАСТРОЙКА ПЕРИОДА
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
        Объект.НачалоПериода = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Объект.КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Партнер) Тогда
		Правило = ПолучитьПомеченноеНаУдалениеПравило(Партнер);
		ЗаполнитьТаблицуРеализаций();
	Иначе
	    Правило = Неопределено;
		РеализацииДляУдаленияПравил.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПравилоПриИзменении(Элемент)
	ЗаполнитьТаблицуРеализаций();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыЗакрытиеМесяца

&НаКлиенте
Процедура Команда12_ЗаписатьАрхивСводки(Команда)
	ЗаписатьАрхивСводкиНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура Команда13_ЗаписатьПродажиПоМесяцам(Команда)
	ЗаписатьПродажиПоМесяцам();
КонецПроцедуры

#КонецОбласти

#Область КомандыПроизводство

&НаКлиенте
Процедура Команда24_ПересчитатьСебестоимостьПродукции(Команда)
	ПересчитатьСебестоимостьПродукции();
КонецПроцедуры

&НаКлиенте
Процедура Команда25_ПересчитатьСебестоимостьФабриката(Команда)
	ПересчитатьСебестоимостьФабриката();
КонецПроцедуры

#КонецОбласти

#Область КомандыОбновление

&НаКлиенте
Процедура Команда31_ОбновитьИдентификаторыОбъектовМетаданных(Команда)
	ОбновитьИдентификаторыОбъектовМетеданныхНаСервере(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Команда32_ОбновитьВариантыОтчетов(Команда)
	ОбновитьВариантыОтчетовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Команда34_ОчиститьРегистрыДоставки(Команда)
	ОчиститьРегистры();
КонецПроцедуры

#КонецОбласти

#Область КомандыОчистка

&НаКлиенте
Процедура Команда41_ПометитьДоговораКлиентов(Команда)
	ПометитьДоговораКлиентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Команда42_ПометитьДоговораПоставщиков(Команда)
	ПометитьДоговораПоставщиковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Команда43_ПометитьКонтагентов(Команда)
	ПометитьКонтагентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Команда44_ПометитьПартнеров(Команда)
	ПометитьПартнеровНаСервере();
КонецПроцедуры

#КонецОбласти

#Область КомандыПравилаПродаж

&НаКлиенте
Процедура Команда45_УдалитьПравилоИзРеализаций(Команда)
	Для каждого Стр Из РеализацииДляУдаленияПравил Цикл
		УдалитьПравило(Стр.Документ);
	КонецЦикла;
	
	ЗаполнитьТаблицуРеализаций();
КонецПроцедуры

&НаКлиенте
Процедура Команда46_УдалитьВсеПравила(Команда)
	УдалитьВсеПравилаНаСервере();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыЗакрытиеМесяца

&НаСервере
Процедура ЗаписатьАрхивСводкиНаСервере()
	мср.СоздатьАрхивСводки(КонецДня(ДатаАрхива));
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПродажиПоМесяцам()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыПродукции());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(д.Дата, МЕСЯЦ) КАК Дата,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ д.Ссылка) КАК КоличествоПродаж,
	|	т.Номенклатура КАК Номенклатура,
	|	н.Наименование КАК Наименование,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И д.Проведен
	|	И н.ВидНоменклатуры В (&ВидыНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(д.Дата, МЕСЯЦ),
	|	т.Номенклатура,
	|	н.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Дата КАК Период,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.КоличествоПродаж КАК КоличествоПродаж,
	|	вт.Количество КАК Количество
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	вт.Наименование
	|ИТОГИ ПО
	|	Период";
	
	Рез = Запрос.Выполнить();
	
	ВыбДата = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбДата.Следующий() Цикл
		Набор = РегистрыСведений._ПродажиПоМесяцам.СоздатьНаборЗаписей();
		
		Набор.Отбор.Период.Установить(ВыбДата.Период);
		Набор.Прочитать();
		Набор.Очистить();
	
		ВыбНом = ВыбДата.Выбрать();
		Пока ВыбНом.Следующий() Цикл
			Стр = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,ВыбНом);
		КонецЦикла;
		
		Набор.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Команда14_ВыгрузкаПродаж(Команда)
	ВыгрузкаПродаж();
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПроизводство

&НаСервере
Процедура ПересчитатьСебестоимостьПродукции()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"   , Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|ГДЕ
	|	д.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.Дата";
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Док = Выб.Ссылка.ПолучитьОбъект();
		
		Фабрикаты = Док.Фабрикаты;
		Продукция = Док.Продукция;
		
		//@skip-check query-in-loop
		ТабЦен = ПолучитьЦеныПродукции(Фабрикаты,Продукция,Док.Дата);
		
		Для каждого Стр Из ТабЦен Цикл
			ТекСтр = Продукция.Найти(Стр.Продукция,"Номенклатура");
			ТекСтр.Цена  = Стр.Цена;
		КонецЦикла;
		
		Док.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныПродукции(Фабрикаты,Продукция,Дата) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", Фабрикаты);
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Вода", Справочники.Номенклатура.НайтиПоКоду("01-00000017"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ф.Номенклатура КАК Фабрикат,
	|	ф.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	&Фабрикаты КАК ф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.Номенклатура КАК Продукция,
	|	п.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ п
	|ИЗ
	|	&Продукция КАК п
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Фабрикат КАК Фабрикат,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество / ЕСТЬNULL(с.Количество, 1) КАК Количество
	|ПОМЕСТИТЬ фтовары
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК с
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|			ПО с.Ссылка = т.Ссылка
	|		ПО ф.Спецификация = с.Ссылка
	|ГДЕ
	|	НЕ т.Номенклатура = &Вода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вз.Номенклатура КАК Номенклатура,
	|	Цены.Цена / ЕСТЬNULL(Цены.Упаковка.Числитель, 1) / ном.КоэффициентЕдиницыДляОтчетов КАК Цена
	|ПОМЕСТИТЬ фцены
	|ИЗ
	|	(ВЫБРАТЬ
	|		Цены.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Цены.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|	ГДЕ
	|		Цены.Номенклатура В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					фтовары КАК т)
	|		И Цены.Период < &Дата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Цены.Номенклатура) КАК вз
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|		ПО вз.Номенклатура = Цены.Номенклатура
	|			И вз.Период = Цены.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вз.Номенклатура = ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фтовары.Фабрикат КАК Фабрикат,
	|	СУММА(ЕСТЬNULL(фтовары.Количество, 0) * ЕСТЬNULL(фцены.Цена, 0)) КАК Цена
	|ПОМЕСТИТЬ ф1
	|ИЗ
	|	фтовары КАК фтовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ фцены КАК фцены
	|		ПО фтовары.Номенклатура = фцены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	фтовары.Фабрикат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	п.Продукция КАК Продукция,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ птовары
	|ИЗ
	|	п КАК п
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|		ПО п.Спецификация = т.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вз.Номенклатура КАК Номенклатура,
	|	Цены.Цена / ЕСТЬNULL(Цены.Упаковка.Числитель, 1) / ном.КоэффициентЕдиницыДляОтчетов КАК Цена
	|ПОМЕСТИТЬ пцены
	|ИЗ
	|	(ВЫБРАТЬ
	|		Цены.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Цены.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|	ГДЕ
	|		Цены.Номенклатура В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					птовары КАК т)
	|		И Цены.Период < &Дата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Цены.Номенклатура) КАК вз
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|		ПО вз.Номенклатура = Цены.Номенклатура
	|			И вз.Период = Цены.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вз.Номенклатура = ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	птовары.Продукция КАК Продукция,
	|	СУММА(ЕСТЬNULL(птовары.Количество, 0) * ЕСТЬNULL(пцены.Цена, ЕСТЬNULL(ф1.Цена, 0))) КАК Цена
	|ИЗ
	|	птовары КАК птовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ пцены КАК пцены
	|		ПО птовары.Номенклатура = пцены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ф1 КАК ф1
	|		ПО птовары.Номенклатура = ф1.Фабрикат
	|
	|СГРУППИРОВАТЬ ПО
	|	птовары.Продукция";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

&НаСервере
Процедура ПересчитатьСебестоимостьФабриката()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"   , Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|ГДЕ
	|	д.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.Дата";
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Док = Выб.Ссылка.ПолучитьОбъект();
		
		Фабрикаты = Док.Фабрикаты;
		
		//@skip-check query-in-loop
		ТабЦен = ПолучитьЦеныФабриката(Фабрикаты,Док.Дата);
		
		Для каждого Стр Из ТабЦен Цикл
			ТекСтр = Фабрикаты.Найти(Стр.Фабрикат,"Номенклатура");
			ТекСтр.Цена  = Стр.Цена;
		КонецЦикла;
		
		Док.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныФабриката(Фабрикаты,Дата) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фабрикаты", Фабрикаты);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Вода", Справочники.Номенклатура.НайтиПоКоду("01-00000017"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ф.Номенклатура КАК Фабрикат,
	|	ф.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	&Фабрикаты КАК ф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Фабрикат КАК Фабрикат,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество / ЕСТЬNULL(с.Количество, 1) КАК Количество
	|ПОМЕСТИТЬ фтовары
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК с
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК т
	|			ПО с.Ссылка = т.Ссылка
	|		ПО ф.Спецификация = с.Ссылка
	|ГДЕ
	|	НЕ т.Номенклатура = &Вода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вз.Номенклатура КАК Номенклатура,
	|	Цены.Цена / ЕСТЬNULL(Цены.Упаковка.Числитель, 1) / ном.КоэффициентЕдиницыДляОтчетов КАК Цена
	|ПОМЕСТИТЬ фцены
	|ИЗ
	|	(ВЫБРАТЬ
	|		Цены.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Цены.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|	ГДЕ
	|		Цены.Номенклатура В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.Номенклатура КАК Номенклатура
	|				ИЗ
	|					фтовары КАК т)
	|		И Цены.Период < &Дата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Цены.Номенклатура) КАК вз
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК Цены
	|		ПО вз.Номенклатура = Цены.Номенклатура
	|			И вз.Период = Цены.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|		ПО вз.Номенклатура = ном.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фтовары.Фабрикат КАК Фабрикат,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(фтовары.Количество, 0) * ЕСТЬNULL(фцены.Цена, 0) КАК ЧИСЛО(10, 2))) КАК Цена
	|ИЗ
	|	фтовары КАК фтовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ фцены КАК фцены
	|		ПО фтовары.Номенклатура = фцены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	фтовары.Фабрикат";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

#КонецОбласти

#Область ПроцедурыОбновление

&НаСервере
Процедура ОбновитьИдентификаторыОбъектовМетеданныхНаСервере(ЕстьИзменения, ЕстьУдаленные)
	УстановитьПривилегированныйРежим(Истина);
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(ЕстьИзменения, ЕстьУдаленные);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВариантыОтчетовНаСервере()
	УстановитьПривилегированныйРежим(Истина);
    ВариантыОтчетов.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОчиститьРегистры()
	Набор = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
	Набор.Записать();
	
	Набор = РегистрыСведений.ТоварыКДоставке.СоздатьНаборЗаписей();
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОчистка

&НаСервере
Процедура ПометитьДоговораКлиентовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктВыполненныхРабот.Договор
		|ПОМЕСТИТЬ вт1
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
		|
		|СГРУППИРОВАТЬ ПО
		|	АктВыполненныхРабот.Договор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1.Договор
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт1 КАК вт1
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ПОМЕСТИТЬ вт3
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	вт3.Договор
		|ИЗ
		|	вт3 КАК вт3
		|ГДЕ
		|	НЕ вт3.Договор В
		|				(ВЫБРАТЬ
		|					вт2.Договор
		|				ИЗ
		|					вт2 КАК вт2)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дог = ВыборкаДетальныеЗаписи.Договор.ПолучитьОбъект();
		Дог.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПометитьДоговораПоставщиковНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Договор
		|ПОМЕСТИТЬ вт1
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслуг.Договор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеУслугПрочихАктивов.Договор
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеУслугПрочихАктивов.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1.Договор
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт1 КАК вт1
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ПОМЕСТИТЬ вт3
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	т.Договор
		|ИЗ
		|	вт3 КАК т
		|ГДЕ
		|	НЕ т.Договор В
		|				(ВЫБРАТЬ
		|					вт2.Договор
		|				ИЗ
		|					вт2 КАК вт2)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дог = ВыборкаДетальныеЗаписи.Договор.ПолучитьОбъект();
		Дог.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПометитьКонтагентовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктВыполненныхРабот.Контрагент
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	АктВыполненныхРабот.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Контрагент
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивов.Контрагент
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеУслугПрочихАктивов.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Контрагент
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеБезналичныхДенежныхСредств.Контрагент
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеБезналичныхДенежныхСредств.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт1.Контрагент
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	вт1 КАК вт1
	|
	|СГРУППИРОВАТЬ ПО
	|	вт1.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК т
	|ГДЕ
	|	НЕ т.Ссылка В
	|				(ВЫБРАТЬ
	|					вт2.Контрагент
	|				ИЗ
	|					вт2 КАК вт2)
	|	И НЕ т.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)";
	
	Результат = Запрос.Выполнить();
 	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекОбъект = Выборка.Контрагент.ПолучитьОбъект();
		ТекОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПометитьПартнеровНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Партнер
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Партнер,
	|	Партнеры.ДатаРегистрации
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	НЕ Партнеры.Ссылка В
	|				(ВЫБРАТЬ
	|					вт.Партнер
	|				ИЗ
	|					вт КАК вт)
	|	И НЕ Партнеры.Ссылка = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И Партнеры.Родитель = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партнеры.ДатаРегистрации,
	|	Партнеры.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект = ВыборкаДетальныеЗаписи.Партнер.ПолучитьОбъект();
		ТекОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПравилаПродаж

&НаСервереБезКонтекста
Функция ПолучитьПомеченноеНаУдалениеПравило(Партнер)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Ссылка
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК т
	|ГДЕ
	|	т.Владелец = &Владелец
	|	И т.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.AMS_ПравилаПродаж.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуРеализаций()
	Если ЗначениеЗаполнено(Правило) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Правило", Правило);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	д.Ссылка КАК Документ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК д
		|ГДЕ
		|	д.AMS_ПравилоПродажи = &Правило
		|
		|УПОРЯДОЧИТЬ ПО
		|	д.МоментВремени";
		
		Табл = РеквизитФормыВЗначение("РеализацииДляУдаленияПравил");
		Табл = Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(Табл,"РеализацииДляУдаленияПравил");
	Иначе
		РеализацииДляУдаленияПравил.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеПравилаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаПродаж.Ссылка КАК Правило,
	|	Реализация.Ссылка КАК Реализация
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК ПравилаПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО ПравилаПродаж.Ссылка = Реализация.AMS_ПравилоПродажи
	|ГДЕ
	|	ПравилаПродаж.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПравилаПродаж.Наименование,
	|	Реализация.МоментВремени";
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		УдалитьПравило(Выб.Реализация);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаПродаж.Ссылка КАК Правило,
	|	ЗаказКлиента.Ссылка КАК Реализация
	|ИЗ
	|	Справочник.AMS_ПравилаПродаж КАК ПравилаПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ПравилаПродаж.Ссылка = ЗаказКлиента.AMS_ПравилоПродажи
	|ГДЕ
	|	ПравилаПродаж.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПравилаПродаж.Наименование,
	|	ЗаказКлиента.МоментВремени";
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		УдалитьПравило(Выб.Реализация);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьПравило(Документ)
	Если ЗначениеЗаполнено(Документ) Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.AMS_ПравилоПродажи = Справочники.AMS_ПравилаПродаж.ПустаяСсылка();
		ДокументОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаПродаж()
	мср.ВыгрузкаПродаж();
КонецПроцедуры

#КонецОбласти

#КонецОбласти
